# Combining DataFrames in Pandas
---

In today's project, we're going to look at nutritional information from several chain restaurants. The problem is our data is split up into several CSVs. We'll need to combine them into one dataframe, which is a very important skillset as a data scientist.

## Concatenation: Setup

1. Create two dataframes from **foods-a.csv** and ** foods-b.csv**. 
2. For each dataframe, set the index to be the `id` column.

In [2]:
import pandas as pd

In [3]:
fa = pd.read_csv('./datasets/foods_a.csv')
fb = pd.read_csv('./datasets/foods_b.csv')

fa.set_index('id', inplace=True)
fb.set_index('id', inplace=True)

In [4]:
fa.head()

                           name
id
0        Blue Raspberry Slushee
1        Blue Raspberry Slushee
2        Blue Raspberry Slushee
3        Blue Raspberry Slushee
4   Breaded Onion Rings (Large)

In [5]:
fb.head()

                                     name
id
2001      Cinnamon Honey Butter (1 ounce)
2002       Classic Calabash and Gold Ribs
2003      Classic Calabash Chicken Dinner
2004                 Classic Cheeseburger
2005  Classic FATZ Famous Fish, Blackened

## Concatenating along the row axis

It's not enough to merely combine two dataframes, we have to specify whether we want them to be combined along the row axis (**axis=0**) or column axis (**axis=1**). Since our two dataframes have the same column of data, we'll want to combine them along the row axis.

Using pandas' [concat](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html) method, combine our two food dataframes into one:

In [3]:
pd.concat([fa, fb]).head(2)

                      name
id
0   Blue Raspberry Slushee
1   Blue Raspberry Slushee

Compare the shape of your combined dataframe to the shapes of the original two dataframes.

In [4]:
print('before: fa={}  fb={}, concatenated: {}'.format(fa.shape, fb.shape, pd.concat([fa, fb]).shape))

before: fa=(2001, 1)  fb=(2641, 1), concatenated: (4642, 1)

## Concatenating along the column axis

Now that we have our dataframe, let's add some nutritional information. 

1. Create a dataframe from **nutrition.csv**
2. Set your index to be the id column, so that our nutrition index matches our food names index

In [7]:
nu = pd.read_csv('./datasets/nutrition.csv')
nu.set_index('id', inplace=True)

Now that our two dataframes have the same index, we can concanate them into one dataframe along the column axis:

In [11]:
pd.concat([pd.concat([fa, fb]),nu], axis=1).head(3)

                      name  calories  carbs  fat
id
0   Blue Raspberry Slushee       270   67.0    0
1   Blue Raspberry Slushee       370   91.0    0
2   Blue Raspberry Slushee       570  142.0    0

# Joining

There are several ways to join two or more data frames. Here's an image to illustrate each possibility:

![](./assets/Joins.png)

## Joining practice

Load **foods.csv** into a dataframe.

In [13]:
f = pd.read_csv('./datasets/foods.csv')
f.head()

   id                         name  restaurant_id  category_id
0   0       Blue Raspberry Slushee              1            1
1   1       Blue Raspberry Slushee              1            1
2   2       Blue Raspberry Slushee              1            1
3   3       Blue Raspberry Slushee              1            1
4   4  Breaded Onion Rings (Large)              1            3

You'll notice it's the same as the one we concatenated above, with a couple of extra columns: restaurant_id and category_id. These columns correspond to the `id` columns in **categories.csv** and **restaurants.csv**

Load **categories.csv** and **restaurants.csv** into dataframes.

In [15]:
cat = pd.read_csv('./datasets/categories.csv')
rest = pd.read_csv('./datasets/restaurants.csv')

In [16]:
cat.head(1)

   id    name
0   1  Drinks

In [17]:
rest.head()

                                    name  id
0                        A&W Restaurants   1
1                             Applebee's   2
2                                 Arby's   3
3                  Atlanta Bread Company   4
4  Bojangle's Famous Chicken 'n Biscuits   5

Using pandas [merge](http://pandas.pydata.org/pandas-docs/stable/merging.html) method, inner join **restaurants** with **foods**.

Now combine **categories** with **foods**

In [11]:
cat.merge(f, how='right', left_on='id', right_on='category_id').head(3)

   id_x  name_x  id_y                  name_y  restaurant_id  category_id
0     1  Drinks     0  Blue Raspberry Slushee              1            1
1     1  Drinks     1  Blue Raspberry Slushee              1            1
2     1  Drinks     2  Blue Raspberry Slushee              1            1

# Review
---

What are the differences between joining and concatenating?

When would we use one or the other?

**For me, I don't see that there is a big gab between the two.
The first seems to do a smaller work that the second does.
But, with join you would seem to have more control over what goes on.
You would be able to set condations, you would be able to have more control over the full proccess.**